9/data/attachments/1d0a375bb0baa72e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_57c0ffc4-d148-40b0-9854-4359852bcd50</nif:username>
            <nif:friendToBeAdded>Scott_entire_Friend_54903_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>